app/views/users/show.html.erb

<% end %>
<% if current_user.reviews.any? %>
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? ORDER BY "reviews"."created_at" DESC  [["user_id", 5]]