app/views/welcome/home.html.erb

    <h3><%= link_to city.name, city_path(city) %></h3>
      <% city.cuisines.uniq.each do |cuisine| %>
---
SELECT "cuisines".* FROM "cuisines" INNER JOIN "restaurants" ON "cuisines"."id" = "restaurants"."cuisine_id" WHERE "restaurants"."city_id" = ?  [["city_id", 3]]