app/views/restaurants/_list_restaurants.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = ? LIMIT ?  [["restaurant_id", 10], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 5]]
---
  <%= link_to restaurant.name, restaurant_path(restaurant) %> (<%= restaurant.cuisine.name %>)<br>
  <% if restaurant.reviews.any? %>