app/views/restaurants/_list_reviews.html.erb

<ul>
  <% restaurant.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ? ORDER BY "reviews"."created_at" DESC  [["restaurant_id", 5]]