app/views/restaurants/_validation_errors.html.erb

INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tapasssss"], ["created_at", "2018-01-22 13:25:46.626565"], ["updated_at", "2018-01-22 13:25:46.626565"]]
---
  <% error_messages << object.errors.full_messages if object.errors.any? %>
  <% error_messages << object.cuisine.errors.full_messages if object.cuisine.errors.any?%>