app/views/restaurants/new.html.erb

SELECT "cuisines".* FROM "cuisines"
SELECT "cities".* FROM "cities"
---
  <%= f.label :cuisine %>
  <%= f.select 'cuisine', options_from_collection_for_select(@cuisines, 'id', 'name'), include_blank: true %>
  <%= f.label :city %>
  <%= f.select 'city', options_from_collection_for_select(@cities, 'id', 'name'), include_blank: true %>