app/views/restaurants/show.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = ? LIMIT ?  [["restaurant_id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 14]]
---

<% if @restaurant.reviews.any? %>