app/controllers/cities_controller.rb

  def show
    @city = City.find_by(id: params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]