app/controllers/cuisines_controller.rb

  def show
    @cuisine = Cuisine.find(params[:id])
    @city = City.find(params[:city_id])
    all_restaurants = @city.restaurants.sort_by{ |restaurant| restaurant.average_rating }.reverse
    @restaurants = all_restaurants.select{|restaurant| restaurant.cuisine_id == @cuisine.id}
---
SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."city_id" = ?  [["city_id", 3]]