app/controllers/restaurants_controller.rb

SELECT "cities".* FROM "cities"
SELECT "cuisines".* FROM "cuisines"
---
  def new
    @restaurant = Restaurant.new
    @cities = City.all
    @cuisines = Cuisine.all