app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.valid? && @restaurant.cuisine.valid? && @restaurant.city.valid?
      @restaurant.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chicago"], ["created_at", "2018-01-22 09:43:13.333029"], ["updated_at", "2018-01-22 09:43:13.333029"]]
INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2018-01-22 09:43:23.751507"], ["updated_at", "2018-01-22 09:43:23.751507"]]
INSERT INTO "restaurants" ("city_id", "name", "cuisine_id", "created_at", "updated_at", "price_range") VALUES (?, ?, ?, ?, ?, ?)  [["city_id", 8], ["name", "New Restaurant"], ["cuisine_id", 4], ["created_at", "2018-01-22 19:39:29.351442"], ["updated_at", "2018-01-22 19:39:29.351442"], ["price_range", "$$$"]]

  def destroy
    restaurant = Restaurant.find(params[:id])
    restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 10]]