app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 5], ["LIMIT", 1]]
---
  def new
    @restaurant = Restaurant.find(params[:restaurant_id])
    if !current_user.reviews.find_by(restaurant_id: @restaurant.id)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "content", "user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["content", "deliciosooo"], ["user_id", 1], ["restaurant_id", 14], ["created_at", "2018-01-13 18:53:10.298040"], ["updated_at", "2018-01-13 18:53:10.298040"]]
---
  def create
    @restaurant = Restaurant.find(params[:review][:restaurant_id])
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    if @review.valid?
      @review.save

SELECT  "reviews".* FROM "reviews" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @review = Review.find_by(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "content" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 3], ["content", "Great food but we had to wait soooo long"], ["updated_at", "2018-01-21 14:41:49.162956"], ["id", 1]]
---
  def update
    @restaurant = Restaurant.find(params[:review][:restaurant_id])
    @review = Review.find(params[:id])
    edited_review = Review.new(review_params)
    edited_review.user = current_user
      if edited_review.valid?
        @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE (1) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    review = Review.find_by(params[:id])
    review.destroy