app/controllers/welcome_controller.rb

  def home
    @cuisines = Cuisine.all
    @cities = City.all.sort_by{ |city| city.name }
---
SELECT "cuisines".* FROM "cuisines"
SELECT "cities".* FROM "cities"