app/views/cities/show.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."city_id" = ?  [["city_id", 3]]
---
<ul>
  <% @city.restaurants.each do |restaurant| %>